In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('income.csv', names=['name', 'income'], skiprows=[0])
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

Percentile is used in outlier detection and removing outliers

In [3]:
a = df.income.quantile(0.65)
b = df.income.quantile(0.65, interpolation='lower')
c = df.income.quantile(0.65, interpolation='higher')
print((a + b )/2)
d = df.income.quantile(0.65)
e = df.income.quantile(0.65, interpolation='linear')
print(a, b, c, d, e)

7225.0
7450.0 7000 7500 7450.0 7450.0

Filling missing values

In [4]:
df.iloc[3]['income'] = np.NaN
df

C:\Users\Hp\AppData\Local\Temp\ipykernel_21856\121518163.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[3]['income'] = np.NaN

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [5]:
# Method 1: Using iloc
# df.iloc[2, 1] = np.NaN
# Method 2: Using loc with row index and column name
df.loc[3, 'income'] = np.NaN
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [6]:
# Mean shouldnt be calculated when there are outliers, instead we need to calculate median or other methods
df_new = df.copy()
df_new['income'] = df_new['income'].fillna(df_new['income'].median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0